{
    "current_topic" : "What, if anything, is the purpose of the INTP type in society?",
    "interval" : 60,
    "topic_channel" : "224706766263287818",
    "topic_queue" : [],
    "topics" : {
        "0" : {
            "content" : "If primates never became intelligent, which species would have most likely developed tools and advanced to where we are today?",
            "created_at" : "Mon Oct 31 08:43:28 2016",
            "creator" : "centipeda"
        },
        "1" : {
            "content" : "Should we, as a society, decrease the amount of time we're in front of screens?",
            "created_at" : "Wed Nov  2 03:11:33 2016",
            "creator" : "centipeda"
        },
        "2" : {
            "content" : "Should we fight fire with fire?",
            "created_at" : "Wed Jan 25 23:43:11 2017",
            "creator" : "dark twain"
        },
        "3" : {
            "content" : "Will China surpass the west in economic and political power?",
            "created_at" : "Thu Jan 26 17:51:33 2017",
            "creator" : "dark twain"
        },
        "4" : {
            "content" : "What, if anything, is the purpose of the INTP type in society?",
            "created_at" : "Sun Feb  5 20:04:53 2017",
            "creator" : "centipeda"
        },
        "5" : {
            "content" : "Is it fine to key someone's car if they took up multiple parking spaces that other people need and also are clearly a jerk?",
            "created_at" : "Thu Feb  9 03:30:07 2017",
            "creator" : "kishan975"
        },
        "6" : {
            "content" : "What if forward thinking corporations someday supplant the current system of geographic divisions? Global super powers such as Russia, USA, China, will not exist, nor will any other countries except perhaps a few periphery nations which hold out. Corporations are totalitarian states, with complete monopolies within their borders, who employ all citizens. They are basically governments, but hold to the beliefs and systems that define them in current times, plus quite a bit of warmongering/imperialistic/world domination tendencies. Amazon, Google, and Apple control 80% of the Earth's surface between them (with highly disputed boarders, which are constantly fought over). 5% belongs to the remaining countries, who are unwilling to give up their ancestor's national identities, which have in fact been distorted into nearly unrecognizeable, highly regressive cultures.  The last 15% are tribal wastelands plagued by roaming bands of failed corporate superpowers (The most notable being the Walmar Republic, a nomadic misnomer brigade of poorly equipped zealots). Microsoft controls the Moon, and Tesla has expanded across at least half of Mars. Toyota blasted off nearly a century ago in a massive, self sustaining spaceship supercity, and has not been seen since.",
            "created_at" : "Tue Mar 14 12:35:39 2017",
            "creator" : "centipeda"
        }
    }
}